{
    "case_details": {
        "case_name": [
            "Anjum Kadari & Anr.",
            "Union of India & Ors."
        ],
        "case_number": "Special Leave Petition (C",
        "date": "05 November 2024"
    },
    "legal_issues": [
        "Issue arose as to correctness of the order passed by the High \nCourt holding the Uttar Pradesh Board of Madarsa Education \nAct, 2004 to be unconstitutional on the ground that it violates the \nprinciple of secularism and Articles 14 and 21A of the Constitution."
    ],
    "key_findings": [
        "Madarsa Act regulates the standard of education in Madarsas \nrecognized by the Board for imparting Madarsa education ",
        "Provisions of the Madarsa Act seek to “regulate” Madarsas \nwhich are educational institutions run by religious minority ",
        "Enactment of the Act of 2004 is to regulate the standard \nof education in Madarsas recognized by the Board for imparting \nMadarsa education ",
        "Art.21-A provides that the State shall provide free and \ncompulsory education to all children of the age of six to fourteen \nyears in such manner as the State may, by law, determine ",
        "In the spirit of positive secularism, Art.30 confers special \nrights on religious and linguistic minorities because of their numerical \nhandicap and to instil in them a sense of security and confidence ",
        "Statute can be struck down only for the violation of Part III \nor any other provision of the Constitution or for being without [2024] 11 S.C.R.  369\nAnjum Kadari & Anr. v. Union of India & Ors.\nlegislative competence ",
        "State has an interest in ensuring that minority educational \ninstitutions provide standards of education similar to other \neducational institutions "
    ],
    "referenced_laws": [
        "Art.21-A and 30 – Interplay of Art.21-A \nand Art.30 – Explanation",
        "Arts.25-30, 14-16 – Secularism in the \nconstitutional context – Secularism and regulation of minority \neducational institutions – Stated. [Paras 37-45]\nConstitution of India – Art.30(1) – Secularism – Concept of \npositive secularism ",
        "Basis structure doctrine – Testing the \nvalidity of a statute for violation of the basic structure",
        "Minority educational institutions – \nRegulation of, by the State",
        "Legislative competence of the state \nlegislature – Interpretation of the entries in the Seventh \nSchedule – Relevant principles – Elucidated.  [Para 84]\nCase Law Cited\nAnshuman Singh Rathore v. Union of India and Others,  Writ \n(C) No. 6049 of 2023; S.R. Bommai v. Union of India [ 1994] 2 \nSCR 644; Dr. M. Ismail Faruqui v. Union of India [1994] Supp. 5 \nSCR 1 "
    ],
    "cited_cases": [
        "Anshuman Singh Rathore v. Union of India and Others",
        " S.R. Bommai v. Union of India ",
        " Dr. M. Ismail Faruqui v. Union of India ",
        " Seshammal v. State of Tamil Nadu  ",
        "D.A.V. College v. State of Punjab ",
        " Aruna Roy v. Union of India ",
        "Society v. State of Gujarat  ",
        " T.M.A. Pai Foundation v. State of Karnataka ",
        " Indira Nehru Gandhi v. Raj Narain  ",
        " State of Kerala v. Peoples ",
        "State of A.P. v. McDowell ",
        " State of Karnataka v. Union of India ",
        " Kuldip Nayar v. Union of India ",
        " Madras Bar Association v. Union of ",
        "Record Association v. Union of India ",
        " State of Kerala v. Very Rev. Mother Provincial ",
        "Society v. State of Maharashtra ",
        " Sidhajbhai Sabhai v. State of Bombay ",
        " Milli Talimi Mission v. State of ",
        " Association v. Union of India ",
        " Supriyo v. Union of India ",
        " St Stephens College v. University of Delhi  ",
        "Kumar Dhariwal v. Union of India ",
        " Neil Aurelio Nunes v. Union of India ",
        " Bharatiya Seva Samaj Trust v. Yogeshbhai ",
        "Tamil Nadu v. K Shyam Sunder ",
        "Educational and Cultural Trust v. Union of India ",
        "Higher Secondary Education v. K S Gandhi ",
        " Anr. v. Union of India ",
        "s Collective Efforts v. State of W.B. ",
        " Anr. v. State ",
        "Chamarbaugwalla v. Union of India "
    ],
    "judgment_summary": " Madarsa Act, if need to be struck down as some of its provisions contravened the provisions of the UGC Act, would be beyond the legislative competence of the state . While the Madarsas do impart religious instruction, their primary aim is education – Mere fact that the education which is sought to be regulated includes some religious teachings or instruction, does not automatically push the legislation out of state legislative competence . Only the provisions which pertain to Fazil and Kamil are unconstitutional, the Act otherwise remains valid .  Madarsa Act grants recognition to Madarsas to enable students to sit for an examination and obtain a degree, diploma, or certificate . Act secures the interests of the minority community in Uttar Pradesh because it regulates the standard of education imparted by the recognised Madaras . High Court erred in holding that education provided under the 2004 Act is violative of Art.21A because RTE Act which facilitates the fulfilment of the fundamental right u/Art.21 contains a specific provision by which it does not apply to minority educational institutions .  Constitution of India – Art.30(1) – Secularism – Concept of positive secularism : Held . Positive concept of secularism requires the State to treat minority institutions on par with secular institutions while allowing them to retain their minority character . Positive secularism finds consonance in principle of substantive equality . High Court erred in holding that a statute is bound to be struck down if it is violative of the basic structure of the Constitution . State has interest in ensuring that minority educational institutions provide standards of education similar to other educational institutions .  Case Law Cited Anshuman Singh Rathore v. Union of India and Others, Writ (C) No. 6049 of 2023 . Case Law Cases Cited: State of Kerala v. Peoples Union for Civil Liberties [2009] 11 SCR 142 : (2009) 8 SCC 46; St Stephens College v. University of Delhi [1991] Supp. 3 SCR 721 : (1996) 3 SCC 709; In re Kerala Education Bill 1957 [1959] 1 SCR 995 : 1958 SCC OnLine SC 8; Saints High School v. Government of AP .  Madrasa Education Act, 2004; Principle of secularism; Regulate standards of education, qualifications for teachers, and conduct of examinations . Constitution of India; Constitution (Forty-second Amendment) Act, 1976; Uttar Pradesh Non-Government Arabic and Persian Madarsa Recognition, Administration and Services Regulations, 2016; Bihar State Madarasa Education Board Act 1982; Government of India Act 1935 . List of Websites: http://www.pib.gov.in/sites/upload_files/mhrd/files/uploaded_document/ SPQEM-scheme.  Case Arising From CIVIL APPELLATE/ ORIGINAL JURISDICTION: Special Leave Petition (C) No. 8541 of 2024 from the Judgment and Order dated 22.03.2024 of the High Court of Judicature at Allahabad, Lucknow Bench in WC No. 6049 of 2023 . Case Arises from C. No. 7857, 7821, 7822, 7878, 7890 and 13038 of 2024 ."
}